#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДОбавим коммент
	ДФИ.СоздатьПолеРеквизитаОбъекта(ЭтотОбъект, "ТестРеквизитСтрока", ЭтотОбъект);
	ДФИ.СоздатьПолеРеквизитаОбъекта(ЭтотОбъект, "ТестРеквизитЧисло", ЭтотОбъект);
	ДФИ.СоздатьПолеРеквизитаОбъекта(ЭтотОбъект, "ТестРеквизитДата", ЭтотОбъект);
	ДФИ.СоздатьПолеРеквизитаОбъекта(ЭтотОбъект, "ТестРеквизитБулево", ЭтотОбъект);

	Сообщить("дывлоалы");

КонецПроцедуры

#КонецОбласти
